## Plan Result (v3-proxy-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11222018129)



<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/V3ProxyApi-Prod/ecs/aws-otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
      + tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = [
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "production"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4030/.well-known/server-health || exit 1",
                        ]
                      + interval    = 15
                      + retries     = 3
                      + startPeriod = 0
                      + timeout     = 5
                    }
                  + image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/v3proxyapi-prod-app:latest"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/V3ProxyApi-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 4030
                          + hostPort      = 4030
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/V3ProxyApi/Prod/SENTRY_DSN"
                        },
                      + {
                          + name      = "UNLEASH_ENDPOINT"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                      + {
                          + name      = "UNLEASH_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:V3ProxyApi/Prod/UNLEASH_KEY"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
              + {
                  + command                = [
                      + "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  + environment            = []
                  + essential              = true
                  + image                  = "amazon/aws-otel-collector"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/V3ProxyApi-Prod/ecs/aws-otel-collector"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "aws-otel-collector"
                  + portMappings           = [
                      + {
                          + containerPort = 4138
                          + hostPort      = 4138
                          + protocol      = "tcp"
                        },
                      + {
                          + containerPort = 4137
                          + hostPort      = 4137
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + repositoryCredentials  = {
                      + credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/V3ProxyApi-Prod-TaskExecutionRole"
      + family                   = "V3ProxyApi-Prod"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
      + tags_all                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/V3ProxyApi-Prod-TaskRole"
      + track_latest             = false
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be created
  + resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "V3ProxyApi-Prod-TaskRolePolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
      + tags_all         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-v3proxyapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "V3ProxyApi"
        }
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 will be created
  + resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "V3ProxyApi-Prod-TaskRole"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod:319" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":799,"Program":"tfcmt","SHA1":"5f5d53243ec7a1303770683511f452727367bc75","Target":"v3-proxy-api-cdk-production","Vars":{},"WorkflowName":"V3 Proxy API"} -->